In [1]:
def get_square(a):
    return a**2

print(get_square(3))

9

In [2]:
# 람다 함수
lambda_square = lambda a: a**2
print(lambda_square(3))

9

In [3]:
a = [1,2,3]
squares = map(lambda x: x**2, a) # a의 원소 각각에 x를 대입하여 x**2을 계산
list(squares) # map -> list

[1, 4, 9]

In [5]:
import pandas as pd
titanic_df = pd.read_csv('train.csv')
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x: len(x)) #lambda 함수 사용, 특정 열 원소에 함수 적용

In [6]:
titanic_df[['Name', 'Name_len']].head(3)

                                                Name  Name_len
0                            Braund, Mr. Owen Harris        23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...        51
2                             Heikkinen, Miss. Laina        22

In [7]:
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x: 'Child' if x <=15 else 'Adult')
titanic_df[['Age', 'Child_Adult']].head(8)

    Age Child_Adult
0  22.0       Adult
1  38.0       Adult
2  26.0       Adult
3  35.0       Adult
4  35.0       Adult
5   NaN       Adult
6  54.0       Adult
7   2.0       Child

In [11]:
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x: 'Child' if x<= 15 else ('Adult' if x<=60 else 'Elderly'))
titanic_df['Age_cat'].value_counts() # 연령대별 인원 수

Age_cat
Adult      609
Elderly    199
Child       83
Name: count, dtype: int64

In [12]:
def get_category(age):
    cat = ''
    if age <= 5:
        cat = 'Baby'
    elif age <= 12:
        cat = 'Child'
    elif age <= 18:
        cat = 'Teenager'
    elif age <= 25:
        cat = 'Student'
    elif age <= 35:
        cat = 'Young Adult'
    elif age <= 60:
        cat = 'Adult'
    else:
        cat = 'Elderly'

    return cat

titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x: get_category(x))
titanic_df[['Age', 'Age_cat']].head(10)

    Age      Age_cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult
5   NaN      Elderly
6  54.0        Adult
7   2.0         Baby
8  27.0  Young Adult
9  14.0     Teenager